In [104]:
import geopandas as gpd 
import pandas as pd
from shapely import ops
import os
import shapely
import numpy as np
import psycopg2
import networkx as nx
import multiprocessing as mp
import pandana as pdna
from pandana import Network
from mpl_toolkits.basemap import Basemap
from shapely import wkt
from shapely.geometry import Polygon, LineString, Point, box
import matplotlib.pyplot as plt
from geoalchemy2 import Geometry, WKTElement
from sqlalchemy import *

from shapely.geometry import *
shapely.speedups.enable()
shapely.speedups.enable()

%matplotlib inline

In [83]:
# get cencus tract
con = psycopg2.connect(database="walkability", user="postgres", password=1234,
    host="172.19.118.205",port="5432")
ct = gpd.read_postgis('SELECT * FROM walkability.public.census_tracts_blank',con)

In [84]:
ct.head(3)

,gid,__gid,ctuid,ctname,pruid,prname,cmauid,cmapuid,cmaname,cmatype,shape_leng,shape_area,ctnum,geotext,geom
0,1,62,5350001.00,0001.00,35,Ontario,535,35535,Toronto,B,36906.495474,6.619690e+06,535000100.0,535000100,(POLYGON ((320588.9306980086 4835855.647789237...
1,2,63,5350002.00,0002.00,35,Ontario,535,35535,Toronto,B,32534.307654,3.293422e+06,535000200.0,535000200,"(POLYGON ((316642.831678931 4832470.554474635,..."
2,3,87,5350264.00,0264.00,35,Ontario,535,35535,Toronto,B,12241.116870,3.464007e+06,535026400.0,535026400,(POLYGON ((314351.8668838083 4845056.100542194...

In [117]:
#import sys,os,os.path
#os.environ['HTTP_PROXY']="http://asulaim:8888@137.15.73.132:8080"
#os.environ['HTTPS_PROXY']="https://asulaim:8888@137.15.73.132:8080"
#import requests
#from contextlib import closing
#import csv

#with closing(requests.get(csvurl, stream=True)) as r:
 #   reader = csv.reader(r.iter_lines())
 #   list = list(reader)
 #   for row in list:
  #      # Handle each row here...
  #      print(row)

In [85]:

#df = pd.read_csv('/media/DATADRIVE/realestate/rental_prices/census_tracts/bedr_type_2010.csv')
#ftp://asulaim@172.19.118.205/media/DATADRIVE/walkability/ablajan/str_size_2010.csv
#df = pd.read_csv('/media/DATADRIVE/walkability/ablajan/str_size_2010.csv')
df = pd.read_csv('/media/DATADRIVE/realestate/rental_prices/census_tracts/bedr_type_2017.csv', delimiter= ",", skiprows=2)

In [86]:
df.dtypes

Unnamed: 0      object
Bachelor        object
Unnamed: 2      object
1 Bedroom       object
Unnamed: 4      object
2 Bedroom       object
Unnamed: 6      object
3 Bedroom +     object
Unnamed: 8      object
Total           object
Unnamed: 10     object
Unnamed: 11    float64
dtype: object

In [87]:
df.head()

,Unnamed: 0,Bachelor,Unnamed: 2,1 Bedroom,Unnamed: 4,2 Bedroom,Unnamed: 6,3 Bedroom +,Unnamed: 8,Total,Unnamed: 10,Unnamed: 11
0,0001.00,**,NaN,**,NaN,**,NaN,**,NaN,**,NaN,NaN
1,0002.00,**,NaN,**,NaN,**,NaN,**,NaN,**,NaN,NaN
2,0004.00,820,a,947,b,"1,126",b,**,NaN,953,b,NaN
3,0005.00,702,c,"1,003",c,**,NaN,**,NaN,958,d,NaN
4,0007.01,890,b,"1,078",b,**,NaN,**,NaN,"1,121",c,NaN

In [88]:
df.tail(10)

,Unnamed: 0,Bachelor,Unnamed: 2,1 Bedroom,Unnamed: 4,2 Bedroom,Unnamed: 6,3 Bedroom +,Unnamed: 8,Total,Unnamed: 10,Unnamed: 11
626,0831.02,**,NaN,"1,145",b,"1,476",b,**,NaN,"1,322",b,NaN
627,Toronto,"1,013",a,"1,194",a,"1,403",a,"1,589",a,"1,308",a,NaN
628,Notes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
629,The following letter codes are used to indicat...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
630,** Data suppressed to protect confidentiality ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
631,++ Change in rent is not statistically signifi...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
632,- No units exist in the universe for this cat...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
633,n/a: Not applicable,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
634,"CMA, CA and CSD definitions are based on 2016 ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
635,Source,CMHC Rental Market Survey,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [89]:
#df.drop(df.index[0], inplace=True)
#df.drop(['Toronto', 'Notes', 'The following letter codes are used to indicate the reliability of the estimates: a - Excellent, b- Very good, c - Good, d - Fair (Use with Caution)', '** Data suppressed to protect confidentiality or data not statistically reliable', '++ Change in rent is not statistically significant. This means that the change in rent is not statistically different than zero (0).  (Applies only to % Change of Average Rent Tables).', ' - No units exist in the universe for this category', 'n/a: Not applicable', 'CMA, CA and CSD definitions are based on 2006 Census Geography Definitions', 'Source'])
#df.drop(df.index[627], inplace=True)
#df.drop(df.index[627], inplace=True)
df.drop(df.tail(9).index,inplace=True)
df.columns

Index(['Unnamed: 0', 'Bachelor', 'Unnamed: 2', '1 Bedroom', 'Unnamed: 4',
       '2 Bedroom', 'Unnamed: 6', '3 Bedroom +', 'Unnamed: 8', 'Total',
       'Unnamed: 10', 'Unnamed: 11'],
      dtype='object')

In [90]:
df = df.rename(columns={'Unnamed: 0': 'ctname', 'Unnamed: 2': 'reliability_ba', '1 Bedroom': 'bedroom_1', 'Unnamed: 4': 'reliability_b1', '2 Bedroom': 'bedroom_2', 'Unnamed: 6': 'reliablity_b2', '3 Bedroom +': 'bedroom_3', 'Unnamed: 10': 'reliability_t' })
df.columns

Index(['ctname', 'Bachelor', 'reliability_ba', 'bedroom_1', 'reliability_b1',
       'bedroom_2', 'reliablity_b2', 'bedroom_3', 'Unnamed: 8', 'Total',
       'reliability_t', 'Unnamed: 11'],
      dtype='object')

In [91]:
df['Year'] = '2017'

In [92]:
df.head(3)

,ctname,Bachelor,reliability_ba,bedroom_1,reliability_b1,bedroom_2,reliablity_b2,bedroom_3,Unnamed: 8,Total,reliability_t,Unnamed: 11,Year
0,0001.00,**,NaN,**,NaN,**,NaN,**,NaN,**,NaN,NaN,2017
1,0002.00,**,NaN,**,NaN,**,NaN,**,NaN,**,NaN,NaN,2017
2,0004.00,820,a,947,b,"1,126",b,**,NaN,953,b,NaN,2017

In [108]:
shdf = ct.merge(df, left_on='ctname', right_on='ctname')
shdf.head(3)

,gid,__gid,ctuid,ctname,pruid,prname,cmauid,cmapuid,cmaname,cmatype,...,bedroom_1,reliability_b1,bedroom_2,reliablity_b2,bedroom_3,Unnamed: 8,Total,reliability_t,Unnamed: 11,Year
0,1,62,5350001.00,0001.00,35,Ontario,535,35535,Toronto,B,...,**,NaN,**,NaN,**,NaN,**,NaN,NaN,2017
1,2,63,5350002.00,0002.00,35,Ontario,535,35535,Toronto,B,...,**,NaN,**,NaN,**,NaN,**,NaN,NaN,2017
2,4,94,5350082.00,0082.00,35,Ontario,535,35535,Toronto,B,...,**,NaN,**,NaN,**,NaN,**,NaN,NaN,2017

In [112]:
#convert df to gdf
shdf['geometry'] = shdf['geom'].apply(lambda x: WKTElement(x.wkt, srid=2019))
shdf = gpd.GeoDataFrame(shdf)
shdf.crs = {'init': 'epsg:2019'}

In [114]:
#shdf

In [115]:
# Creating SQLAlchemy's engine to use
engine = create_engine('postgresql://postgres:1234@172.19.118.205:5432/walkability')

#shdf['geometry'] = shdf['geom'].apply(lambda x: WKTElement(x.wkt, srid=2019))

#drop the geometry column as it is now duplicative
shdf= shdf.drop('geom', 1, inplace=False)

# Use 'dtype' to specify column's type
# For the geom column, we will use GeoAlchemy's type 'Geometry'
shdf.to_sql("walkability_shdf", engine, if_exists='replace', index=False, 
                         dtype={'geometry': Geometry('MULTIPOLYGON', srid= 2019)})